app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `tb_user`
SELECT COUNT(*) AS `numrows` FROM `tb_kamar`
---
    public function index(): string
    {
        $user = model(UserModel::class);
        $kamar = model(KamarModel::class);
        $data = [
            'total_kamar' => $user->countAll(),
            'total_user' => $kamar->countAll()
        ];