app/Controllers/Kamar.php

SELECT `harga_air`, `id`
FROM `tb_pengaturan`
WHERE `id` = 1
---
    public function index(): string
    {
        helper('form');
        $model = model(KamarModel::class);
        $data['kamar'] = $model->getKamar();
        $db = \Config\Database::connect();
        $builder = $db->table('tb_pengaturan');
        $data['harga_air'] =  $builder->select('harga_air, id')->where('id', 1)->get()->getRowArray();

SELECT `harga_air`
FROM `tb_pengaturan`
WHERE `id` = 1
---
    public function jsonHargaAir()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('tb_pengaturan');
        $hargaAir = $builder->select('harga_air')->where('id', 1)->get()->getRowArray();