app/Controllers/Recievedata.php

INSERT INTO `tb_liter_air` (`kode_kamar`, `penggunaan_air`) VALUES ('kamar2', '2')
---
    public function index()
    {
        $kamar = $this->request->getGet('kamar');
        $liter = $this->request->getGet('liter');

        $db = \Config\Database::connect();
        $data = [
            'kode_kamar' => $kamar,
            'penggunaan_air' => $liter
        ];
        $db->table('tb_liter_air')->insert($data);