app/Controllers/User.php

    public function store()
    {
        helper(['form', 'text']);
        $data = $this->request->getPost(['nama_lengkap', 'email', 'no_hp', 'password']);
        if(!$this->validateData($data, [
            'nama_lengkap' => 'required',
            'email' => 'required|valid_email',
            'no_hp' => 'required|numeric',
            'password' => 'required|min_length[7]'
            ])){
                return $this->add();
            }

        $post = $this->validator->getValidated();
        $model = model(UserModel::class);
        $model->save([
            'nama_lengkap' => $post['nama_lengkap'],
            'email' => $post['email'],
            'no_hp' => $post['no_hp'],
            'password' => password_hash($post['password'], PASSWORD_DEFAULT)
        ]);
---
INSERT INTO `tb_user` (`nama_lengkap`, `email`, `no_hp`, `password`) VALUES ('Widya Khartika', 'widyakk14@gmail.com', '081237573019', '$2y$10$nDFEYrOXXvr9PFxgpe5KuesIYhLK4Mp5bD48Xc2ud9ePsfKw9/ZYy')