app/Models/KamarModel.php

    public function getKamar($id = false)
    {
        if ($id === false) {
            return $this->select('tb_kamar.*, tb_user.nama_lengkap')->join('tb_user', 'tb_user.id = tb_kamar.id_user', 'left')->findAll();
---
SELECT `tb_kamar`.*, `tb_user`.`nama_lengkap`
FROM `tb_kamar`
LEFT JOIN `tb_user` ON `tb_user`.`id` = `tb_kamar`.`id_user`