app/Models/UserModel.php

SELECT *
FROM `tb_user`
---
    public function getUsers($id = false){
        if($id === false){
            return $this->findAll();